# Homework: Joins & Tidy Data

## Question 1
Read in all 4 credit card transaction datasets and clean up the column names.

- CardBase.csv
- CustomerBase.csv
- FraudBase.csv
- TransactionBase.csv

In [ ]:
import pandas as pd
# conda install pyjanitor -c conda-forge
from janitor import clean_names

In [ ]:
card_base = pd.read_csv("data/CardBase.csv")
customer_base = pd.read_csv("data/CustomerBase.csv")
fraud_base = pd.read_csv("data/FraudBase.csv")
transaction_base = pd.read_csv("data/TransactionBase.csv")

In [ ]:
#conda update -n base -c defaults conda

In [ ]:
# https://pyjanitor-devs.github.io/pyjanitor/
df = pd.DataFrame.from_dict(card_base).clean_names()
df
#card_base = pd.clean_names(card_base)
#print(card_base)

In [11]:
fraud_base.head()

  Transaction_ID  Fraud_Flag
0   CTID50558449           1
1   CTID55936882           1
2   CTID63762180           1
3   CTID76723439           1
4   CTID21246201           1

In [12]:
transaction_base.head()

,Transaction_ID,Transaction_Date,Credit_Card_ID,Transaction_Value,Transaction_Segment
0,CTID28830551,24-Apr-16,1629-9566-3285-2123,23649,SEG25
1,CTID45504917,11-Feb-16,3697-6001-4909-5350,26726,SEG16
2,CTID47312290,1-Nov-16,5864-4475-3659-1440,22012,SEG14
3,CTID25637718,28-Jan-16,5991-4421-8476-3804,37637,SEG17
4,CTID66743960,17-Mar-16,1893-8853-9900-8478,5113,SEG14